---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLamp
source: html/da192df1-1903-2b83-ef0b-dda53a073f45.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLamp Property

"Lamp"

## Syntax (C#)
```csharp
public static ForgeTypeId LightingFixtureLamp { get; }
```